OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/compressibleInterFoam/laminar/waterCooler/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compressibleInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

maxCo           0.5;
maxAlphaCo      0.5;


libs        (utilityFunctionObjects);

DebugSwitches
{
    //fvPatchField        1;
    //fvPatchScalarField  1;
    //mappedPatchBase 1;
    //syncObjects     1;
    //regIOobject     2;
}

functions
{
    syncObjects
    {
        type        syncObjects;
        libs        (utilityFunctionObjects);
    }
}


// ************************************************************************* //
